Repository: jpmgoes/vibe-whisper
Catalog: lib/l10n/app_*.arb
Languages: ar, vi

# recordingIndicator
source: Listening...
ar: جاري الاستماع...
vi: Đang nghe...

source: Settings
ar: الإعدادات
vi: Cài đặt

source: API Settings
ar: إعدادات API
vi: Cài đặt API

source: Groq API Key
ar: مفتاح API الخاص بـ Groq
vi: Khóa API Groq

# llmModel
source: Treatment Model (LLM)
ar: نموذج المعالجة (LLM)
vi: Mô hình Xử lý (LLM)

source: Whisper Model
ar: نموذج Whisper
vi: Mô hình Whisper

# generalSettings
source: General
ar: عام
vi: Chung

source: Theme Mode
ar: المظهر
vi: Chủ đề

source: Language
ar: اللغة
vi: Ngôn ngữ

# autoPaste
source: Auto-Paste into Active Field
ar: لصق تلقائي في الحقل النشط
vi: Tự động dán vào trường hoạt động

source: System
ar: النظام
vi: Hệ thống

source: Light
ar: فاتح
vi: Sáng

source: Dark
ar: داكن
vi: Tối

source: Global Shortcut
ar: اختصار عام
vi: Phím tắt toàn cầu

source: Save
ar: حفظ
vi: Lưu

source: Success
ar: نجاح
vi: Thành công

source: Error
ar: خطأ
vi: Lỗi

# textCopied
source: Text copied to clipboard
ar: تم نسخ النص إلى الحافظة
vi: Đã sao chép văn bản vào clipboard

# enterApiKey
source: Please enter your API Key
ar: الرجاء إدخال مفتاح API الخاص بك
vi: Vui lòng nhập khóa API của bạn

source: Processing
ar: جاري المعالجة
vi: Đang xử lý

source: Error. Try again.
ar: خطأ. حاول مرة أخرى.
vi: Lỗi. Thử lại.

# invalidApiKey
source: Invalid API Key or no models found.
ar: مفتاح API غير صالح أو لم يتم العثور على نماذج.
vi: Khóa API không hợp lệ hoặc không tìm thấy mô hình.

# setupWorkspace
source: Set up your workspace
ar: قم بإعداد مساحة العمل الخاصة بك
vi: Thiết lập không gian làm việc của bạn

# configureVoice
source: Configure your voice settings and AI connection to unlock powerful voice-to-text features.
ar: قم بتهيئة إعدادات الصوت واتصال الذكاء الاصطناعي الخاص بك لفتح ميزات تحويل الصوت إلى نص.
vi: Cấu hình cài đặt giọng nói và kết nối AI để mở khóa các tính năng giọng nói thành văn bản.

source: Primary Language
ar: اللغة الأساسية
vi: Ngôn ngữ chính

source: Get Started
ar: البدء
vi: Bắt đầu

# keyStoredLocally
source: Your key is stored locally and encrypted.
ar: يتم تخزين مفتاحك محليًا وتشفيره.
vi: Khóa của bạn được lưu trữ an toàn trên thiết bị và được mã hóa.

source: Toggle Recording
ar: تبديل التسجيل
vi: Bật/Tắt Ghi âm

source: Fill active field
ar: تعبئة الحقل النشط
vi: Điền vào trường hoạt động

# settingsSaved
source: Settings saved automatically.
ar: تم حفظ الإعدادات تلقائيًا.
vi: Cài đặt đã tự động lưu.

source: Save Changes
ar: حفظ التغييرات
vi: Lưu thay đổi

source: History
ar: السجل
vi: Lịch sử

source: Clear All
ar: مسح الكل
vi: Xóa tất cả

source: Transcription History
ar: سجل النسخ
vi: Lịch sử phiên âm

# noHistoryContent
source: No transcription history yet.
ar: لا يوجد سجل نسخ بعد.
vi: Chưa có lịch sử phiên âm nào.

source: Original Audio
ar: الصوت الأصلي
vi: Âm thanh Gốc

source: Processed Output
ar: المخرجات المعالجة
vi: Đầu ra đã xử lý

source: Copied Original
ar: تم نسخ الأصل
vi: Đã sao chép bản gốc

# copiedWhisper
source: Whisper transcription copied to clipboard.
ar: تم نسخ نسخ Whisper إلى الحافظة.
vi: Phiên âm Whisper đã được sao chép vào khay nhớ tạm.

source: Copied Processed
ar: تم نسخ المعالج
vi: Đã sao chép phần xử lý

# copiedProcessedMsg
source: Processed text copied to clipboard.
ar: تم نسخ النص المعالج إلى الحافظة.
vi: Văn bản đã xử lý được sao chép vào khay nhớ tạm.

# clearHistoryTitle
source: Clear History
ar: مسح السجل
vi: Xóa lịch sử

# clearHistoryMsg
source: Are you sure you want to delete all transcription history? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف كل سجل النسخ؟ لا يمكن التراجع عن هذا الإجراء.
vi: Bạn có chắc chắn muốn xóa tất cả lịch sử phiên âm không? Không thể hoàn tác hành động này.

source: Cancel
ar: إلغاء
vi: Hủy
